; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-3-5-1-3-1)
    (:domain grid)
    (:objects
    pos0-0 pos0-1 pos0-2 pos0-3 pos0-4 pos1-0 pos1-1 pos1-2 pos1-3 pos1-4 pos2-0 pos2-1 pos2-2 pos2-3 pos2-4
    shape0
    key0 key1 key2
    )

    (:init
       (arm-empty)

       (place pos0-0)
       (place pos0-1)
       (place pos0-2)
       (place pos0-3)
       (place pos0-4)
       (place pos1-0)
       (place pos1-1)
       (place pos1-2)
       (place pos1-3)
       (place pos1-4)
       (place pos2-0)
       (place pos2-1)
       (place pos2-2)
       (place pos2-3)
       (place pos2-4)
       (shape shape0)
       (key key0)
       (key key1)
       (key key2)

       (conn pos0-0 pos1-0)
       (conn pos0-0 pos0-1)
       (conn pos0-1 pos1-1)
       (conn pos0-1 pos0-2)
       (conn pos0-1 pos0-0)
       (conn pos0-2 pos1-2)
       (conn pos0-2 pos0-3)
       (conn pos0-2 pos0-1)
       (conn pos0-3 pos1-3)
       (conn pos0-3 pos0-4)
       (conn pos0-3 pos0-2)
       (conn pos0-4 pos1-4)
       (conn pos0-4 pos0-3)
       (conn pos1-0 pos2-0)
       (conn pos1-0 pos1-1)
       (conn pos1-0 pos0-0)
       (conn pos1-1 pos2-1)
       (conn pos1-1 pos1-2)
       (conn pos1-1 pos0-1)
       (conn pos1-1 pos1-0)
       (conn pos1-2 pos2-2)
       (conn pos1-2 pos1-3)
       (conn pos1-2 pos0-2)
       (conn pos1-2 pos1-1)
       (conn pos1-3 pos2-3)
       (conn pos1-3 pos1-4)
       (conn pos1-3 pos0-3)
       (conn pos1-3 pos1-2)
       (conn pos1-4 pos2-4)
       (conn pos1-4 pos0-4)
       (conn pos1-4 pos1-3)
       (conn pos2-0 pos2-1)
       (conn pos2-0 pos1-0)
       (conn pos2-1 pos2-2)
       (conn pos2-1 pos1-1)
       (conn pos2-1 pos2-0)
       (conn pos2-2 pos2-3)
       (conn pos2-2 pos1-2)
       (conn pos2-2 pos2-1)
       (conn pos2-3 pos2-4)
       (conn pos2-3 pos1-3)
       (conn pos2-3 pos2-2)
       (conn pos2-4 pos1-4)
       (conn pos2-4 pos2-3)
       (locked pos2-2)
       (lock-shape  pos2-2 shape0)
       (open pos0-0)
       (open pos0-1)
       (open pos0-2)
       (open pos0-3)
       (open pos0-4)
       (open pos1-0)
       (open pos1-1)
       (open pos1-2)
       (open pos1-3)
       (open pos1-4)
       (open pos2-0)
       (open pos2-1)
       (open pos2-3)
       (open pos2-4)

       (key-shape  key0 shape0)
       (key-shape  key1 shape0)
       (key-shape  key2 shape0)
       (at key0 pos1-2)
       (at key1 pos1-3)
       (at key2 pos2-3)
       (at-robot pos0-2)
    )

    (:goal (and
       (at key0 pos0-1)
       (at key2 pos2-1)
    )))

; plan
1. (move pos0-2 pos1-2)
   deleted: (at-robot pos0-2)
   added: (at-robot pos1-2)
   goals met: 0 of 2
2. (pickup pos1-2 key0)
   deleted: (at key0 pos1-2) (arm-empty)
   added: (holding key0)
   goals met: 0 of 2
3. (unlock pos1-2 pos2-2 key0 shape0)
   deleted: (locked pos2-2)
   added: (open pos2-2)
   goals met: 0 of 2
4. (move pos1-2 pos0-2)
   deleted: (at-robot pos1-2)
   added: (at-robot pos0-2)
   goals met: 0 of 2
5. (move pos0-2 pos0-1)
   deleted: (at-robot pos0-2)
   added: (at-robot pos0-1)
   goals met: 0 of 2
6. (putdown pos0-1 key0)
   deleted: (holding key0)
   added: (arm-empty) (at key0 pos0-1)
   goals met: 1 of 2
7. (move pos0-1 pos0-2)
   deleted: (at-robot pos0-1)
   added: (at-robot pos0-2)
   goals met: 1 of 2
8. (move pos0-2 pos0-3)
   deleted: (at-robot pos0-2)
   added: (at-robot pos0-3)
   goals met: 1 of 2
9. (move pos0-3 pos1-3)
   deleted: (at-robot pos0-3)
   added: (at-robot pos1-3)
   goals met: 1 of 2
10. (move pos1-3 pos2-3)
   deleted: (at-robot pos1-3)
   added: (at-robot pos2-3)
   goals met: 1 of 2
11. (pickup pos2-3 key2)
   deleted: (at key2 pos2-3) (arm-empty)
   added: (holding key2)
   goals met: 1 of 2
12. (move pos2-3 pos2-2)
   deleted: (at-robot pos2-3)
   added: (at-robot pos2-2)
   goals met: 1 of 2
13. (move pos2-2 pos2-1)
   deleted: (at-robot pos2-2)
   added: (at-robot pos2-1)
   goals met: 1 of 2
14. (putdown pos2-1 key2)
   deleted: (holding key2)
   added: (arm-empty) (at key2 pos2-1)
   goals met: 2 of 2
